tap "applegamer22/tap"
tap "common-fate/granted"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "kidonng/malt"
tap "koekeishiya/formulae"
tap "metafates/mangal"
tap "ryu0118/kusa"
# Language Server for Ansible Files
brew "ansible-language-server"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Official Amazon AWS command-line interface
brew "awscli"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Interface bandwidth monitor
brew "bmon"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful command-line bookmark manager
brew "buku"
# Insanely fast image printing in your terminal
brew "catimg"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Make choices on the command-line
brew "choose"
# Console Matrix
brew "cmatrix"
# High performance code minimap generator
brew "code-minimap"
# Fix common misspellings in source code and text files
brew "codespell"
# DuckDuckGo from the terminal
brew "ddgr"
# Highly Configurable Terminal Dashboard for Developers
brew "devdash"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line DNS client
brew "dog"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Linting for your git commit messages
brew "gitlint"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Update multiple git repositories at once
brew "gitup"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go version management
brew "goenv"
# Language server for the Go language
brew "gopls"
# Manage your GnuPG keys with ease! 🔐
brew "gpg-tui"
# Ping, but with a graph
brew "gping"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# CLI email client written in Rust
brew "himalaya"
# Instant coding answers via the command-line
brew "howdoi"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Modern alternative to the watch command
brew "hwatch"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive jq
brew "ijq"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Cost estimates for Terraform
brew "infracost"
# Manage your Java environment
brew "jenv"
# Convert JPG images to ASCII
brew "jp2a"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Link checker and web site maintenance tool
brew "linklint"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# LSP for LanguageTool with support for Latex, Markdown and Others
brew "ltex-ls"
# Language Server for the Lua language
brew "lua-language-server"
# Move files and folders to the trash
brew "macos-trash"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Show markdown documents on text terminals
brew "mdcat"
# Run a Kubernetes cluster locally
brew "minikube"
# Project documentation with Markdown
brew "mkdocs"
# Music Player Daemon
brew "mpd"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text interface for Git repositories
brew "tig"
# Command-line and local web note‑taking, bookmarking, and archiving
brew "nb"
# Ncurses-based client for the Music Player Daemon
brew "ncmpcpp"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Manage multiple NodeJS versions
brew "nodenv"
# Batch rename utility
brew "nomino"
# Classic snake game with textual interface
brew "nsnake"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Command-line Git information tool
brew "onefetch"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Password manager
brew "pass"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Port of pdftk in java
brew "pdftk-java"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Modern replacement for ps written by Rust
brew "procs"
# Command-line tool for managing long-running shell commands
brew "pueue"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Static type checker for Python
brew "pyright"
# Transfer files to and from your computer by scanning a QR code
brew "qrcp"
# Rsync for cloud storage
brew "rclone"
# Find duplicate files based on content (NOT file names)
brew "rdfind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Fast, efficient and secure backup program
brew "restic"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Two-factor authentication on the command-line
brew "rsc_2fa"
# Utility that provides fast incremental file transfer
brew "rsync"
# Tool for shell commands execution, visualization and alerting
brew "sampler"
# Intuitive find & replace CLI
brew "sd"
# CLI and dbus interface for WhisperSystems/libsignal-service-java
brew "signal-cli"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal based presentation tool
brew "slides"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Terminal-based client for Spotify
brew "spotify-tui"
# Graphical command-line client for SSH
brew "sshs"
# Feature-rich console based todo list manager
brew "task"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Reads from existing Cloud Providers and generates Terraform code
brew "terracognita"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform Language Server
brew "terraform-ls"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Schema inspector for Terraform providers
brew "tfschema"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# CLI csv pretty printer
brew "tidy-viewer"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Program that allows you to count code, quickly
brew "tokei"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Maintained ctags implementation
brew "universal-ctags"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Your CLI home video recorder
brew "vhs"
# Modern watch command
brew "viddy"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Translate common Internet acronyms
brew "wtf"
# Personal information dashboard for your terminal
brew "wtfutil"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# Fast CSV toolkit written in Rust
brew "xsv"
# Language Server for Yaml Files
brew "yaml-language-server"
# Copy terminal output to clipboard
brew "yank"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Cross-platform caffeinate alternative.
brew "applegamer22/tap/cocainate"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Turns macOS input fields into real vim buffers
brew "felixkratz/formulae/svim"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# The ultimate CLI manga downloader!
brew "metafates/mangal/mangal"
# Kusa is a CLI application that displays the Github Contributions Graph.
brew "ryu0118/kusa/kusa"
# CLI for managing the battery charging status
cask "battery"
# E-books management software
cask "calibre"
# Elegant Facebook Messenger desktop app
cask "caprine"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Digital photo manager
cask "digikam"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# Enables DisplayLink screens prior to login
cask "displaylink-login-extension"
# Keyboard-only application launcher
cask "dmenu-mac"
# App to build and share containerized applications and microservices
cask "docker"
# Google Chromium, sans integration with Google
cask "eloston-chromium"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Cloaks picture files to circumvent facial recognition
cask "fawkes"
# Multi-platform multi-messaging app
cask "ferdium"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Neovim GUI written in Golang, using a Golang qt backend
cask "goneovim"
# Secure video conferencing app
cask "jitsi-meet"
# Comic and manga converter for ebook readers
cask "kindle-comic-converter"
# Turns comics, graphic novels and manga into Kindle books
cask "kindle-comic-creator"
# GPU-based terminal emulator
cask "kitty"
# Free and open-source painting and sketching program
cask "krita"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Adaptive brightness for external displays
cask "lunar"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Free and open-source RSS reader
cask "netnewswire"
# Podcast platform
cask "pocket-casts"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# VPN client focusing on security
cask "protonvpn"
# Archive manager for data compression and backups
cask "rar"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Keyboard-driven navigation and control tool
cask "vimac"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Comic reader
cask "yacreader"
# Alternative and privacy-friendly YouTube frontend
cask "yattee"
# Anime player and list manager
cask "yuna"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Dark Reader for Safari", id: 1438243180
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Raivo OTP", id: 1498497896
mas "ScanTexter", id: 1635954549
mas "Shazam", id: 897118787
mas "StackOv", id: 1511838391
mas "Vimari", id: 1480933944
mas "WhatsApp", id: 1147396723
